Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་ཡུམ་དུ་ཇི་ལྟར་འགྱུར་བ་དེ་བཞིན་དུ་བྱམས་པའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ། སེང་གེ་དང་། དེ་བཞིན་དུ་རབ་ཏུ་སྣང་བ་དང་། དཔལ་དང་སྤྱན་བཟང་པོ་དང་། མེ་ཏོག་དང་། མེ་ཏོག་དཔལ་དང་། རྒྱས་པ་དང་། རྒྱལ་དང་། ཐུགས་བཟང་པོ་དང་། རྡོ་རྗེ་དང་། རྡུལ་དང་བྲལ་བ་དང་། ཟླ་བ་སྒྲོན་མ་འཛིན་པ་དང་། གྲགས་པ་དང་། རྡོ་རྗེ་དག་པ་དང་། དོན་གཅིག་ཏུ་སྟོན་པ་དང་། མི་དཀར་ཡན་ལག་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། རིན་པོ་ཆེ་འོད་འཕྲོ་བའི་རི་བོ་དང་། སྒྲོན་མ་ཆེན་པོ་འཛིན་པ་དང་། པད་མོ་དམ་པ་དང་། སྒྲ་རྣམ་པར་གྲགས་པ་དང་། ཡོན་ཏན་དཔག་ཏུ་མེད་པ་མངའ་བ་དང་། མར་མེའི་དཔལ་དང་། ཡན་ལག་རྣམ་པར་བརྒྱན་པ་དང་། ལེགས་པར་བཞུད་པ་དང་། བྱམས་པའི་དཔལ་དང་། སྤྲུལ་བ་བཟང་པོ་དང་། གནས་དང་བྲལ་བ་དང་། གཟི་བརྗིད་འབར་བ་དང་། གསུང་མཐའ་ཡས་པ་དང་། ལེན་པ་མེད་པའི་སྤྱན་དང་། ལེན་པ་མེད་པའི་མུ་ཁྱུད་དང་། ཡིད་གཉིས་རྣམ་པར་སེལ་བ་དང་། ཡོངས་སུ་དག་པ་དང་། འོད་ཤིན་ཏུ་ཡངས་པ་དང་། གྲགས་པ་དག་པས་བྱུང་བ་དང་། སྤྲིན་གྱི་དཔལ་དང་། གཙུག་ཕུད་རྣམ་པར་མཛེས་པ་དང་། ཤིང་གི་རྒྱལ་པོ་དང་། རིན་པོ་ཆེའི་དཀྱིལ་འཁོར་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པའི་ཁ་དོག་དང་། བློ་གྲོས་རྒྱ་མཚོ་དང་། རིན་པོ་ཆེ་བཟང་པོ་དང་། སྟོབས་ལ་ཐུབ་པ་མེད་པ་དང་། དགོངས་པ་ཡོངས་སུ་རྫོགས་པ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དབང་པོའི་དཔལ་དང་། མེའི་དཔལ་དང་། མཆོག་གི་དཔལ་དང་། ཙན་དན་གྱི་སྤྲིན་དང་། མི་དཀར་རིངས་པོའི་སྤྱན་དང་། བློ་གྲོས་དམ་པ་དང་། བློ་གྲོས་རྣམ་པར་བསྒོམས་པ་དང་། སྒྲུབ་པའི་རྒྱལ་པོ་དང་། སྦྱོང་བའི་རྒྱལ་པོ་དང་། རྡོ་རྗེ་བློ་གྲོས་དང་། རྣམ་པར་བརྒྱན་པ་དང་། ཕུན་སུམ་སྣ་ཚོགས་དང་། ཟེ་བ་དགའ་བ་དང་། དབང་ཕྱུག་ལྷ་དང་། གཙུག་ཏོར་དཔལ་དང་། ཡེ་ཤེས་རྡོ་རྗེའི་རི་བོ་དང་། དཔལ་གྱི་སྙིང་པོ་དང་། གསེར་གྱི་དྲ་བས་སྐུ་རྣམ་པར་བརྒྱན་པ་དང་། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་དང་། དབང་ཕྱུག་ལྷ་དང་། དབང་ཆེན་ལྷ་དང་། མི་དམིགས་པའི་དཔལ་དང་། རྣམ་པར་དག་པས་དགྱེས་པ་དང་། འོད་འཕྲོ་མངའ་བ་དང་། ཆུའི་དཔལ་དང་། རྣམ་དག་བློ་གྲོས་དང་། ཐེག་པ་དམ་པ་དང་། མཉམས་པའི་ཡོན་ཏན་འབྱུང་བ་དང་། དགྲ་ལས་དབེན་པ་དང་། གསུང་སྒྲོག་པ་དང་། དབང་དུ་གྱུར་པའི་ཡོན་ཏན་གཟི་བརྗིད་དང་། རྣམ་པར་སྣང་མཛད་དཔལ་དང་། དྲི་ཞིམ་པོའི་ལོངས་སྤྱོད་དང་། དྲི་ཞིམ་པོ་རྣམ་པར་ཕྱེ་བ་དང་། ཡན་ལག་རྣམ་པར་ཕྱེ་བ་དང་། ས་ག་བཟང་པོ་དང་། ཞལ་ནས་སྤོས་ཐམས་ཅད་འོད་དུ་འཕྲོ་བ་དང་། རྡོ་རྗེ་རིན་པོ་ཆེས་རྣམ་པར་བརྒྱན་པ་དང་། རབ་ཏུ་བཞད་པའི་སྤྱན་དང་། འདོད་ཆགས་རྡུལ་བཅོམ་དང་། སྐུ་མཆོག་ཏུ་འཁྲུངས་པ་དང་། ལྷའི་དབྱིག་དང་། རླབས་ཆེན་ལྟ་དང་། འགོག་པར་གཞོལ་བ་དང་། ཐུགས་རྣམ་པར་སངས་རྒྱས་པ་དང་། རྡུལ་རྣམ་པར་བསྩལ་པ་དང་། འོད་འཕྲོ་མངའ་ཆེན་དང་། ཉེ་བར་ཞི་བ་མངའ་བ་དང་། ས་གའི་ལྷ་དང་། རྡོ་རྗེ་རི་བོ་དང་། ཡེ་ཤེས་འོད་འཕྲོ་འབར་བའི་སྐུ་དང་། བདེ་མཛད་བ་དང་། བསྐྲུན་པའི་སྟག་དང་། དགེ་བ་ཡོངས་སུ་རྫོགས་པ་དང་། གྲགས་པ་ཡིད་དུ་འོང་བས་བཟང་བ་དང་། མཐུས་རྣམ་པར་གནོན་པ་དང་། དོན་དམ་པ་རྣམ་པར་གནོན་པ་དང་། ཞི་བའི་འོད་ཟེར་དང་། གཅིག་ཏུ་འཕགས་པ་དང་། དབྱངས་ཟབ་མོ་དང་། སའི་བདག་པོ་དང་། དཔག་ཏུ་མེད་པ་དང་། དབྱངས་ཀྱི་དཔལ་དང་། རྣམ་པར་གྲགས་པ་དང་། ལོངས་སྤྱོད་འཐུན་པ་དང་། ལོངས་སྤྱོད་ཚོགས་པ་དང་། སྨན་པའི་དམ་པ་དང་། ཡོན་ཏན་ཟླ་བ་དང་། བཞད་པའི་གཟི་བརྗིད་དང་། ཡོན་ཏན་བསྩགས་པ་དང་། ཟླ་བ་འཕགས་པ་དང་། ཉི་མའི་ལྷ་དང་། འཇིགས་པར་གྲགས་པ་དང་། འོད་ཟེར་གྱི་ཞལ་དང་། སཱ་ལའི་དབང་པོའི་ལྷུན་དང་། གྲགས་པ་དང་། སྨན་གྱི་རྒྱལ་པོ་དང་། རིན་ཆེན་མཆོག་དང་། བློ་གྲོས་རྡོ་རྗེ་དང་། དཀར་པོའི་དཔལ་དང་། གཞི་ཤིན་ཏུ་སྦྱངས་བ་དང་། རིན་ཅེན་རྒྱལ་པོ་དང་། གྲགས་པ་ཆེན་པོ་དང་། ཤུགས་དྲག་འཛིན་པ་དང་། མི་དཔོགས་འོད་དང་། འོད་འཕྲོ་ཆེན་པོས་བཞུགས་པ་དང་། དོན་ཡོད་པའི་ཆོས་ལ་མངའ་བ་དང་། བརྩོན་འགྲུས་མཉམས་པ་དང་། དག་པའི་ལྷ་དང་། འོད་བརྟན་པ་དང་། ཀུན་གྱི་བཤེས་གཉེན་དང་། རྣམ་པར་གྲོལ་བའི་དབྱངས་དང་། རྣམ་པར་བསྒྲགས་པའི་རྒྱལ་པོ་དང་། ཚིག་གཅོད་པ་དང་། ཙམ་པ་ཀ་དྲི་མ་མེད་པའི་འོད་དང་། ཁ་ན་མ་ཐོ་བ་མི་མངའ་བ་དང་། ཟླ་བ་རྣམ་པར་འཕགས་པ་དང་། སྒྲོན་མ་འཛིན་པ་དང་། སྐུ་རྣམ་པར་མཛེས་པ་དང་། བརྗོད་དུ་མེད་པར་འཕགས་པ་དང་། འགྲོ་བའི་བཤེས་གཉེན་དང་། འོད་ཟེར་མང་པོ་དང་། དབྱངས་ཀྱི་ཡན་ལག་དཔའ་བོ་དང་། ཆུའི་ལྷའི་སྤྱན་དང་། མོས་པའི་བློ་གྲོས་མངའ་བའི་གཟི་བརྗིད་དང་། མེ་ཏོག་ཀུན་དའི་དཔལ་དང་། མཆོད་པའི་ཟླ་བ་དང་། བློ་མི་མངའ་བ་དང་། ཆགས་པ་མི་མངའ་བ་དང་། མི་དམིགས་པའི་བློ་གྲོས་དང་། ཕུང་པོ་བསྩགས་པ་དང་། ངན་སོང་རབ་ཏུ་འཇོམས་པ་དང་། མེ་ཏོག་དམ་པ་དང་། སེང་གེ་རྣམ་པར་སྒྲོག་པ་དང་། དོན་མི་དམའ་བ་དང་། བསྒྲིབས་པ་མེད་པར་གཟིགས་པ་དང་། ཕ་རོལ་གྱི་ཚོགས་འཇོམས་པ་དང་། རླུང་གི་མུ་ཁྱུད་དང་། སྙིང་བོ་མི་གཡོ་བ་དང་། སྙིང་པོ་བཟང་པོ་དང་། གཞན་གྱིས་མི་ཐུབ་པའི་རི་བོ་དང་། མི་གནས་ཡེ་ཤེས་དང་། མཐའ་ཡས་བཞུགས་པ་དང་། གཡུལ་དུ་བརྟན་པ་དང་། སྤྱོད་པས་གྲུབ་པ་དང་། བླ་མས་བོན་པ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། རྗེས་སུ་འཛིན་པའི་ཟླ་བ་དང་། ལྷུན་མི་གཡོ་བ་དང་། ཐུགས་དྲག་པོ་དང་། ཐུགས་བརྩེ་བའི་བློ་གྲོས་དང་། ཤིན་ཏུ་མཐོ་འཛིན་པ་དང་། འོད་ཟེར་མུ་ཁྱུད་དང་། མཚན་དཔེ་མེད་པ་དང་། གཟི་བརྗིད་མཉམ་པ་དང་། ཐམས་ཅད་ཁ་དོག་དང་། མཚན་མ་མེད་པའི་ཤེས་རབ་དང་། མི་གཡོ་བའི་ལྷ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དཔལ་དང་། རྣམ་པར་ཐར་བའི་ཟླ་བ་དང་། བླ་ན་མེད་པའི་རྒྱལ་པོ་དང་། ཟླ་བའི་ཕུང་པོ་དང་། མཆོད་པའི་ཚངས་པ་དང་། སྤྱན་མི་འགྱུར་བ་དང་། བྱམས་པའི་རིགས་དང་། ཕྲིན་ལས་འཕགས་པ་དང་། གཉེར་བའི་ཆོས་ཀྱི་བློ་གྲོས་དང་། བླ་ན་མེད་པའི་དཔལ་དང་། ཚངས་པའི་ལྷ་དང་། ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པའི་འོད་དང་། བླ་ན་མེད་པའི་ཆོས་ཀྱི་སྤྱོད་ཡུལ་དང་། མཐའ་ཡས་བཟང་པོ་དང་། ཚུལ་དང་འདྲ་བའི་གཟུངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་མཐོ་བའི་ལྷ་དག་སྟེ།
en: “Just as I will be the mother of the bodhisattva Maitreya, in the same way, after Maitreya’s attainment of the highest, complete enlightenment of buddhahood, I will be the mother of Siṃha , Pradyota, Ketu , Sunetra , Kusuma , Kusumaśrī, Tiṣya, Puṣya, Sumanas, Vajra , Viraja, Candrolkā­dhārin, Yaśas, Vajraśuddha, Ekārtha­darśin, Sitāṅga, Pāraṃgata, Ratnārciḥ­parvata, Maholkādhārin, Padmottara, Vighuṣṭaśabda, Aparimita­guṇa­dharma, Dīpaśrī, Vibhūṣitāṅga, Suprayāṇa, Maitraśrī, Nirmita , Aniketa, Jvalitatejas, Anantaghoṣa, Aninetra, Aninema, Vimativikiraṇa, Pariśuddha, Suviśālābha, Yaśaḥ­śuddhodita, Meghaśrī, Vicitra­bhūta, Druma­rāja, Sarva­ratna­vicitra­varṇa­maṇi­kuṇḍala, Sāgara­mati, Śubharatna, Anihatamalla, Paripūrṇa­manoratha, Maheśvara, Indraśrī, Agniśrī, Pravaraśrī, Candana­megha, Sitaviśālākṣa, Śreṣṭhamati, Vibhāvitamati, Avaropaṇarāja, Uttāpana­rāja­mati, Vajramati , Vibhūṣita, Vibhūti, Keśaranandin, Īśvaradeva, Īśvara, Uṣṇīṣa­śrī, Vajra­jñāna­parvata, Śrīgarbha, Kanaka­jāla­kāya­vibhūṣita, Suvibhakta, Īśvaradeva, Mahendradeva, Anilaśrī, Viśuddhanandin, Arciṣmat, Varuṇaśrī, Viśuddhamati, Agrayāna, Nihita­guṇodita, Arigupta, Vākyanuda, Vaśībhūta, Guṇa­tejas, Vairocanaketu, Vibhavagandha, Vibhāvana­gandha, Vibhaktāṅga, Suviśākha, Sarva­gandhārci­mukha, Vajra­maṇi­vicitra, Prahasitanetra, Nihata­rāga­rajas, Pravṛddha­kāya­rāja, Vāsudeva, Udāradeva, Nirodhanimna, Vibuddhi, Dhūtarajas, Arcirmahendra, Upaśamavat, Viśākhadeva, Vajragiri, Jñānārci­jvalita­śarīra, Kṣemaṃkara, Aupagama, Śārdūla, Paripūrṇa­śubha, Rucira­bhadra­yaśas, Parākrama­vikrama, Paramārtha­vikrāmin, Śānta­raśmi, Ekottara, Gambhīreśvara, Bhūmipati, Amita, Ghoṣaśrī, Viśiṣṭa, Vibhūtapati, Vibhūtabhūta, Vaidyottama, Guṇa­candra, Praharṣita­tejas, Guṇa­saṃcaya, Candrodgata , Bhāskara­deva, Bhīṣmayaśas, Raśmi­mukha, Śālendra­skandha, Yaśas, Auṣadhirāja, Ratnavara, Mativajra, Sitaśrī, Nirghautālaya, Maṇirāja, Mahāyaśas, Vegadhārin, Amitābha, Mahāsanārcis, Moha­dharmeśvara, Nihata­dhīra, Devaśuddha, Dṛḍhaprabha, Viśvāmitra, Vimuktighoṣa, Vinarditarāja, Vākyaccheda, Campaka­vimala­prabha, Anavadya, Viśiṣṭacandra, Ulkādhāriṇ, Vicitra­gātra, Anabhilāpyodgata, Jaganmitra, Prabhūta­raśmi, Svarāṅgaśūra, Varuṇākṣa, Dhṛtamatitejas, Kundaśrī, Arciścandra, Anihitamati, Anunayavigata, Anilambha­mati, Upacitaskandha, Apāya­pramathana, Adīna­kusuma, Siṃha­vinardita, Anihānārtha, Anāvaraṇa­darśin, Para­gaṇa­mathana, Anilanema, Akampitagarbha, Śobhanasāgara, Aparājita­meru, Anilayajñāna, Anantāsana, Ayudhiṣṭhira, Caryāgata, Uttaradatta, Atyanta­candra­mas, Anugrahacandra, Acalaskandha, Agrasānumati, Anugrahamati, Abhyuddhara, Arcitanama, Anupagamanāman, Nihata­tejas, Viśvavarṇa, Animittaprajña, Acaladeva, Acintya­śrī, Vimokṣacandra, Anuttara­rāja, Candra­skandha, Arcitabrahman, Akampyanetra, Anunayagātra, Abhyudgata­karman, Anudharmamati, Anuttara­śrī, Brahmadeva, Acintya­guṇa­prabha, Anuttara­dharma­gocara, Aparyanta­bhadra, Anurūpasvara, and the bodhisattva Abhyuccadeva.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་ལ་སྩོགས་ཏེ། སྨོས་པ་འདི་དག་ལ་སྩོགས་པ་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུམ་དུའང་ཁོ་མོ་ཉིད་འགྱུར་རོ།
en: “Noble one, in that way I will be the mother of all the future tathāgatas, such as Maitreya and the others I have mentioned, and all the other tathāgata arhat samyak­saṃbuddhas of this Bhadra kalpa in this great world realm of a thousand million worlds.

source: །འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་ཏེ།
en: “As it is in this world realm, I will in the same way enter countless world realms in the ten directions throughout the vast extent, without middle or center, of the ways of the realm of phenomena.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་བྱམས་པའི་ཡུམ་དུ་ཡོན་ཏན་གྱི་ཁྱད་པར་བརྗོད་དུ་མེད་པས་འགྱུར་བ་དེ་བཞིན་དུ་ཡོན་ཏན་གྱི་ཁྱད་པར་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པས་དེ་བཞིན་གཤེགས་པ་སེང་གེ་ནས་དེ་བཞིན་གཤེགས་པ་སྣང་བའི་བར་གྱི་ཡུམ་དུ་འགྱུར་རོ།
en: “In the same way that I will be the mother, with countless special qualities, of the Tathāgata Maitreya, I will be the mother, with countless numbers of countless special qualities, of the Tathāgata Siṃha , and so on until the Tathāgata Roca.

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་བསྐལ་བ་བཟང་པོ་བ་རྣམས་ཀྱི་ཡུམ་དུའང་འགྱུར་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པ་འདི་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཐམས་ཅད་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་འཛམ་བུ་གླིང་ཡོད་པ་ཐམས་ཅད་དུ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱད་པ་སྤྱོད་ཅིང་བསྐལ་པ་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱིན་གྱིས་བརླབས་ཏེ། མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་བ་ཐམས་ཅད་ཀྱི་ཡུམ་དུ་ཡང་འགྱུར་རོ།
en: “Just as I am the mother of the tathāgatas of the Bhadra kalpa, in the same way, in all the Jambudvīpas in all the world realms in the entirety of this ocean of world realms called Kusuma­tala­garbha­vyūhālaṃkāra, and in all the world realms throughout the vast extent of world realms, until the last of future kalpas, I will practice the completely good conduct of the bodhisattva and be present in all kalpas in order to ripen and guide beings, and I will be the mother of all the tathāgatas as bodhisattvas in the future.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷ་མོ་སྒྱུ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་རྣམ་པར་བརྒྱན་པ་འདི་བརྙེས་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: After she had spoken, Sudhana, the head merchant’s son, asked Māyādevī, “Āryā, how long has it been since you attained this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer

source: སྨྲས་པ། རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ། སེམས་ཀྱི་ཡུལ་ལས་འདས་པ་རིགས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་མིག་གི་ལམ་གྱིས་རྣམ་པར་དམིགས་པ་རྣམ་པར་ཤེས་པས་བགྲང་བ་ལས་ཡོངས་སུ་འདས་པའི་ཕ་རོལ་ཅིག་ཏུ་བསྐལ་པ་དགེ་བའི་འོད་ཅེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: Māyādevī answered, “Noble one, in the past, in time gone by, countless kalpas ago, beyond the scope of the mind, beyond kalpas that are beyond the number that can be perceived and known by the vision of wise bodhisattvas, there was a kalpa called Śubhaprabha.

source: བསྐལ་པ་དགེ་བའི་འོད་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རི་བོ་ཤིན་ཏུ་མཐོ་བའི་དཔལ་ཞེས་བྱ་བ་རྣམ་པར་དག་ལ་ཀུན་ནས་ཉོན་མོངས་པ་རིན་པོ་ཆེ་དུ་མ་ལས་གྲུབ་པ་ཁོར་ཡུག་དང་བཅས་པ་རི་རབ་དང་རྒྱ་མཚོར་བཅས་པ། འགྲོ་བ་ལྔའི་རྒྱུད་དང་བཅས་པ། སྣ་ཚོགས་བལྟ་ན་མཛེས་པ་ཞིག་བྱུང་སྟེ།
en: In that Śubhaprabha kalpa there was a world realm called Merūdgataśrī, which was both pure and defiled, formed from many jewels, and endowed with Cakravāla mountain ranges, Sumeru mountains, and oceans, the five classes of beings, and a variety of beauties.

source: འཇིག་རྟེན་གྱི་ཁམས་རི་བོ་ཤིན་ཏུ་མཐོ་བའི་དཔལ་དེར་གླིང་བཞི་པ་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་བྱུང་སྟེ།
en: In that Merūdgataśrī world realm there were ten thousand million four-continent worlds.

source: གླིང་བཞི་བ་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་པོ་དེ་དག་གི་དབུས་ན་གླིང་བཞི་པ་དབུ་མ་སེང་གེ་རྒྱལ་མཚན་དམ་པའི་གཟི་བརྗིད་ཅེས་བྱ་བ་ཞིག་ཡོད་པར་གྱུར་ཏེ།
en: In the center of those ten thousand million four-continent worlds was the central four-continent world called Siṃha­dhvajāgra­tejas.

source: གླིང་བཞི་བ་དེར་རྒྱལ་པོའི་གནས་བྱེ་བ་བརྒྱ་ཕྲག་བརྒྱད་ཅུ་བྱུང་བར་གྱུར་ཏོ།
en: In that four-continent world there were eighty thousand million royal cities.

source: །རྒྱལ་པོའི་གནས་བྱེ་བ་བརྒྱ་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་གི་དབུས་སུ་རྒྱལ་པོའི་གནས་དབུ་མ་རྒྱལ་མཚན་གྱི་དམ་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་བྱུང་སྟེ། དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ཞེས་བྱ་བ་བྱུང་ངོ་།
en: In the center of those eighty thousand million royal cities there was the central royal city, called Dhvajāgravatī, in which there was a cakravartin king called Mahā­tejaḥ­parākrama.

source: །རྒྱལ་པོའི་གནས་རྒྱལ་མཚན་གྱི་དམ་པ་དང་ལྡན་པ་དེར་སྙིང་པོ་བྱང་ཆུབ་ཡལ་ག་སྣ་ཚོགས་ཀྱི་འོད་ཅེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: By that royal city of Dhvajāgravatī there was a bodhimaṇḍa called Citra­mañjari­prabhāsa, where dwelled a bodhimaṇḍa goddess by the name of Netraśrī.

source: དེ་ན་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་ཞེས་བྱ་བ་འདུག་འདུག་གོ །སྙིང་པོ་བྱང་ཆུབ་ཡལ་ག་སྣ་ཚོགས་ཀྱི་འོད་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་མཚན་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་ཞིག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་འདུག་པ་ལས་དེའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་བར་ཆད་བྱ་བའི་ཕྱིར་བདུང་ཁ་དོག་བཟང་པོའི་འོད་ཅེས་བྱ་བ་བདུད་ཀྱི་སྡེ་ཆེན་པོའི་འཁོར་དང་ལྡན་པ་ཞིག་ལུས་མི་སྣང་བར་མ་བྱས་པར་དྲུང་དུ་ཕྱིན་པར་གྱུར་ཏོ།
en: “In that bodhimaṇḍa called Citra­mañjari­prabhāsa, the bodhisattva Vimala­dhvaja sat in order to realize omniscience. In order to prevent his realization of omniscience, a māra by the name of Suvarṇaprabha, together with an entourage of a great army of māras, made himself visible and came before him.

source: །འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐོབ་པའི་རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ་ཞིག་སྟེ།
en: “The cakravartin Mahā­tejaḥ­parākrama had attained the power of a bodhisattva and displayed manifestations of great miraculous powers.

source: དེས་བདུད་ཀྱི་སྡེ་དེ་བས་ཀྱང་འཕགས་ལ་ཆེས་མང་བའི་དཔུང་གི་ཚོགས་ཆེན་པོ་མངོན་པར་སྤྲུལ་ཏེ། བདུད་ཀྱི་སྡེ་ཕམ་པར་བྱ་བའི་ཕྱིར་སྙིང་པོ་བྱང་ཆུབ་དེའི་འཁོར་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ་དང་། དེས་བདུད་ཀྱི་སྡེ་ཆེན་པོ་དེ་ཡང་རྣམ་པར་གཏོར་བར་གྱུར་ཏེ།
en: He manifested a great army that was far more numerous than the māra’s army, and in order to defeat the māra’s army, it surrounded the bodhimaṇḍa and scattered the great army of the māra.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་མཚན་དྲི་མ་མེད་པ་དེས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Then the Bhagavat, the Tathāgata Vimala­dhvaja, attained the highest, complete enlightenment of buddhahood.

source: །དེ་ནས་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་གྱིས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ལ་བུའི་འདུ་ཤེས་བསྐྱེད་ནས།
en: “Netraśrī, the bodhimaṇḍa goddess, looked upon the cakravartin king Mahā­tejaḥ­parākrama as her son.

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ནས་སྨོན་ལམ་བཏབ་པ།
en: She bowed to the feet of the Bhagavat and made this prayer:

source: བཅོམ་ལྡན་འདས་བདག་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་འདི་བདག་གི་བུར་གྱུར་ཅིག །ནམ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་ཚེའང་། བདག་ཉིད་དེའི་མར་གྱུར་ཅིག །ཅེས་ནས་དེས་སྨོན་ལམ་དེ་སྐད་དུ་བཏབ་སྟེ།
en: ‘Bhagavat, wherever I am reborn, may the cakravartin Mahā­tejaḥ­parākrama always be my son! May I be his mother when he attains the highest, complete enlightenment at buddhahood.’

source: སྙིང་པོ་བྱང་ཆུབ་ཡལ་ག་སྣ་ཚོགས་ཀྱི་འོད་དེ་ཉིད་ལ་གནས་ཤིང་བསྐལ་བ་འོད་བཟང་པོ་དེ་ཉིད་ལ་དེ་བཞིན་གཤེགས་པ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་བསྙེན་བཀུར་ཏོ།
en: “She dwelled at the Citra­mañjari­prabhāsa bodhimaṇḍa serving a trillion tathāgatas during the Śubhaprabha kalpa.

source: དེའི་ཚེ་དེའི་དུས་ན་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was Netraśrī, the bodhimaṇḍa goddess?

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Noble one, do not think that it was anyone else, for at that time, in that time, I was Netraśrī, the bodhimaṇḍa goddess.

source: དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐོབ་པ། རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ་བདུད་ཀྱི་སྡེ་ཆེན་པོ་རྣམ་པར་འཐོར་བར་བྱེད་བྱེད་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was the cakravartin king Mahā­tejaḥ­parākrama, who had attained the power of a bodhisattva, displayed manifestations of great miraculous powers, and scattered the army of that māra?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, for at that time, in that time, the Tathāgata Arhat Samyak­saṃbuddha Vairocana was Mahā­tejaḥ­parākrama, the cakravartin king.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་དེ་ནས་ཉེ་བར་བཟུང་ནས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་དུའང་འདི་ནི་ཁོ་མོའི་བུར་གྱུར་ཏེ།
en: “Noble one, in that way, from that time onward, wherever I was reborn, in all those lives he has been my son.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་འགྲོ་བའི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་དང་། སྐྱེ་གནས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དགེ་བའི་རྩ་བའི་སྒོ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱུད་ཀྱི་ཚུལ་ཐམས་ཅད་དང་། སྐྱེས་པའི་རབས་ཀྱི་ཚུལ་ཐམས་ཅད་དང་། ལྷའི་དབང་པོའི་ཚེ་ཐམས་ཅད་དང་། འཇིག་རྟེན་གྱི་དབང་པོའི་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དང་། དབང་ཕྱུག་གི་ས་ཐམས་ཅད་དང་། འགྲོ་བའི་རྒྱུད་དུ་སྣང་བ་ཐམས་ཅད་གང་དང་གང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་དུ་ཡང་ཁོ་མོ་ཉིད་འདིའི་ཡུམ་དུ་གྱུར་ཏེ།
en: Wherever he was reborn, practicing bodhisattva conduct in all buddha realms, in all the entrances to roots of merit, in all the ways of bodhisattva conduct, in all the ways of rebirth, in all lifetimes as a lord of devas, as a lord of the world, on the level of a supreme deity, as a light among the classes of beings, wherever he was reborn in order to ripen beings, in all those lifetimes I was his mother.

source: སྲིད་པ་ཐམས་ཅད་དུ་ཡང་ཁོ་མོ་ཉིད་དང་འབྲལ་བ་མེད་པར་ཡུམ་དུ་གྱུར་ཏོ།
en: In all existences I have inseparably been his mother.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་སྒོ་ཐམས་ཅད་དུ་སྐད་ཅིག་སྐད་ཅིག་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་བསྟན་པར་གྱུར་བ་དེ་དག་ཐམས་ཅད་དུའང་ཁོ་མོ་ཉིད་འདིའི་ཡུམ་དུ་གྱུར་ཏོ།
en: I have been his mother in all the miraculous bodhisattva births manifested in each instant through the gateways of bodhisattva births.

source: །འདས་པའི་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་ཚད་མེད་པ་དག་གི་ཡུམ་དུའང་ཁོ་མོ་གྱུར་ཏོ།
en: “I have been the mother of the immeasurable vast extent, without middle or end, of the tathāgatas of the past.

source: །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ད་ལྟར་བྱུང་བ་མཐའ་དང་དབུས་མེད་པ་ཚད་མེད་པ་དག་གི་ཡུམ་དུ་ཡང་ཁོ་མོ་གྱུར་ཏེ།
en: I am the mother of the immeasurable vast extent, without middle or end, of the tathāgatas in the ten directions who have appeared in the present time.

source: དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་གི་སྲིད་པ་ཐ་མ་ལ་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་གྱུར་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྐུ་ལྟེ་བའི་དཀྱིལ་འཁོར་ནས་འོད་ཟེར་མང་པོ་བྱུང་ཞིང་ཁོ་མོའི་ལུས་དང་སེམས་རབ་ཏུ་སྣང་བར་མཛད་དོ།
en: In that way, I have been the mother of a bodhisattva for all tathāgatas in their final lifetime, and from the navel of all those tathāgatas shone many light rays that illuminated my body and mind.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་རྣམ་པར་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྙིང་པོ་དང་ལྡན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བས་མི་ངོམས་པའི་ལྟོ་ཅན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ། བ་སྤུའི་རྩེ་མོ་ལས་འབྱུང་བར་སྟོན་པ་ལ་དབང་བསྒྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could I know or describe the qualities of the bodhisattvas who possess the essence of great compassion, who within themselves are never satisfied in ripening and guiding beings to omniscience, and who manifest from the tips of their body hairs the miraculous manifestations of all tathāgatas? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོའི་གནས་དེ་ཉིད་ན་ལྷའི་བུ་དྲན་པ་དང་ལྡན་པའི་བུ་མོ་ལྷ་དབང་འོད་ཅེས་བྱ་བ་འདུག་གིས།
en: In the paradise of the lord of Trāyastriṃśa resides Surendrābhā, the daughter of the deva Smṛtimat.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷ་མོ་སྒྱུ་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva train in and practice bodhisattva conduct?’

source: ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ་ལྷ་མོ་སྒྱུ་མའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of Māyādevī, circumambulated her many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from Māyādevī.

source: །བམ་པོ་བཅུ་བདུན་པ།
en: Surendrābhā

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོའི་གནས་གང་ན་བ་དང་། ལྷའི་བུ་དྲན་པ་དང་ལྡན་པའི་བུ་མོ་ལྷ་དབང་འོད་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana went to the paradise of the lord of Trāyastriṃśa and approached the deva maiden Surendrābhā, the daughter of the deva Smṛtimat.

source: ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ལྷ་མོ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to the feet of the deva maiden Surendrābhā, circumambulated the deva maiden Surendrābhā many hundreds of thousands of times, keeping her to his right, and then stood before the deva maiden Surendrābhā with his palms together in homage and said, “Āryā, goddess, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་མ་ལྷ་མོ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་དྲན་པ་ཐོགས་པ་མེད་ལ་རྣམ་པར་དག་པས་བརྒྱན་པ་ཞེས་བྱ་བ་ཐོབ་པ་སྟེ།
en: When he had said that, the deva maiden Surendrābhā said to Sudhana, the head merchant’s son, “Noble one, I have attained the bodhisattva liberation called the display of pure, unimpeded memory

source: རིགས་ཀྱི་བུ་ཁོ་མོས་མངོན་པར་དྲན་པ་བསྐལ་པ་ཨུད་པ་ལ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏེ།
en: “Noble one, I remember a kalpa called Utpala in which I served as many tathāgatas as there are grains of sand in the Ganges River.

source: དེ་དག་མངོན་པར་བྱུང་བའི་ཚེའང་ཡོངས་སུ་བསྲུང་བ་བྱས་སོ། །མཆོད་པ་བྱས་སོ། །ལོངས་སྤྱོད་པའི་དོན་དུ་བཟའ་ཤིང་གི་ར་བ་གསོལ་ཏོ།
en: When they set forth, I protected them, made offerings to them, and gave them parks to enjoy.
